; domain
(define (domain HOOKS)
    (:requirements :strips :typing)
    (:types hook)
    (:predicates
        (hooked ?y - hook)
        (holdingLoop)
		(notHoldingLoop)
    )

    (:action request-loop
        :parameters ()
        :precondition (notHoldingLoop)
        :effect (and (holdingLoop) (not (notHoldingLoop)))
    )

    (:action place-loop
        :parameters (?x - hook)
        :precondition (holdingLoop)
        :effect (and (notHoldingLoop) (not (holdingLoop)) (hooked ?x))
    )
)

; problem
(define (problem HOOKING)
  (:domain HOOKS)
  (:objects A B C - hook)
  (:init (holdingLoop))
  (:goal (and (hooked A) (hooked B) (hooked C)))
)

; plan
1. (place-loop c)
   deleted: (holdingloop)
   added: (notholdingloop) (hooked c)
   goals met: 1 of 3
2. (request-loop)
   deleted: (notholdingloop)
   added: (holdingloop)
   goals met: 1 of 3
3. (place-loop a)
   deleted: (holdingloop)
   added: (notholdingloop) (hooked a)
   goals met: 2 of 3
4. (request-loop)
   deleted: (notholdingloop)
   added: (holdingloop)
   goals met: 2 of 3
5. (place-loop b)
   deleted: (holdingloop)
   added: (notholdingloop) (hooked b)
   goals met: 3 of 3
